#+TITLE: jq - Terminal Tooling
#+STARTUP: inlineimages
#+OPTIONS: ^:nil
#+HTML_HEAD: <link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
#+HTML_HEAD: <link rel="stylesheet" href="../css/stylesheet.css" />
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../images/favicon.ico">
#+PROPERTY: header-args:sh :results output :exports both :cache yes

[[file:../index.org][posts]]


* Overview                                                              :cli:

[[https://jqlang.github.io/jq/][jq]] is a utility to search through, filter, and modify =json= content.[fn:2]
You can use it to find a value in a deeply nested object, filter to
only objects which contain a field, map the inner contents of arbitrary
data into a flat list, and much much more.

On mac, it can be installed through homebrew:

#+begin_src sh :exports code
  brew install jq
#+end_src

#+RESULTS:

As an introductory example, say you have the following json input:[fn:1]

#+begin_src sh
  echo '{"Instances": [{"InstanceId": "sdb3871osdhv89044", "Name": "server0",
  "CreationDate": "2021-06-20T03:50:34"},{"InstanceId": "abc123eassa12874", "Name": "server1",
  "CreationDate": "2023-11-01T15:13:06"}, {"InstanceId": "aes54iasg41226c",
  "Name": "server2", "CreationDate": "2023-11-02T12:07:54"}, {"InstanceId":
  "flng45799saooh987", "Name": "server3", "CreationDate": "2023-11-06T21:45:27"}], "ResponseCode": 200}' | tee ~/test.json
#+end_src

#+RESULTS[107d80f02b33101114be58918cfa8c770f5a98b3]:
: {"Instances": [{"InstanceId": "sdb3871osdhv89044", "Name": "server0",
: "CreationDate": "2021-06-20T03:50:34"},{"InstanceId": "abc123eassa12874", "Name": "server1",
: "CreationDate": "2023-11-01T15:13:06"}, {"InstanceId": "aes54iasg41226c",
: "Name": "server2", "CreationDate": "2023-11-02T12:07:54"}, {"InstanceId":
: "flng45799saooh987", "Name": "server3", "CreationDate": "2023-11-06T21:45:27"}], "ResponseCode": 200}


Jq with no additional arguments will parse, format, and highlight incoming json:

#+begin_src sh :exports code
  cat ~/test.json | jq
#+end_src 

#+begin_src json
{
  "Instances": [
    {
      "InstanceId": "sdb3871osdhv89044",
      "Name": "server0",
      "CreationDate": "2021-06-20T03:50:34"
    },
    {
      "InstanceId": "abc123eassa12874",
      "Name": "server1",
      "CreationDate": "2023-11-01T15:13:06"
    },
    {
      "InstanceId": "aes54iasg41226c",
      "Name": "server2",
      "CreationDate": "2023-11-02T12:07:54"
    },
    {
      "InstanceId": "flng45799saooh987",
      "Name": "server3",
      "CreationDate": "2023-11-06T21:45:27"
    }
  ],
  "ResponseCode": 200
}
#+end_src

